# Working in Date & Time

In [22]:
import pandas as pd 
import numpy as np

In [2]:
time =pd.read_csv('dataset\messages.csv')
date =pd.read_csv('dataset\orders.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
# change data type of date and time
# coverting to datetime datatype
date['date'] =pd.to_datetime( date['date'])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
 4   date_year   1000 non-null   int32
dtypes: datetime64[ns](1), int32(1), int64(3)
memory usage: 35.3 KB

 1. Extract year

In [11]:
date['date_year'] = date['date'].dt.year

In [13]:
date.sample(5)

          date  product_id  city_id  orders  date_year
833 2019-11-04        6695        9       5       2019
852 2018-09-04        2706        9       8       2018
296 2018-12-05        3601        9       2       2018
63  2018-08-29        2841       16       3       2018
832 2019-01-11        4445       25       1       2019

2. Extract Month

In [15]:
date['date_month'] =date['date'].dt.month
date.sample(5)

          date  product_id  city_id  orders  date_year  date_month
922 2019-03-28        1658       16      27       2019           3
10  2019-10-24        6339       26       1       2019          10
307 2018-12-06        3034        0       1       2018          12
441 2019-02-15        2906       16       2       2019           2
293 2018-09-12        3151       26       1       2018           9

In [17]:
date['month_name'] =date['date'].dt.month_name()
date.sample()

         date  product_id  city_id  orders  date_year  date_month month_name
42 2018-11-02        1439       25       1       2018          11   November

3. Extract Days

In [19]:
date['no_days'] = date['date'].dt.day
date.sample(2)

,date,product_id,city_id,orders,date_year,date_month,month_name,days,no_days
259,2019-12-10,7246,13,1,2019,12,December,Tuesday,10
402,2018-11-05,4347,25,131,2018,11,November,Monday,5

In [20]:
date['days'] = date['date'].dt.day_name()
date.sample(2)

,date,product_id,city_id,orders,date_year,date_month,month_name,days,no_days
60,2018-08-05,3760,28,1,2018,8,August,Sunday,5
151,2019-10-15,5066,18,14,2019,10,October,Tuesday,15

In [32]:
# is weekend ?
date['date_is_weekend'] =np.where(date['days'].isin(['Sunday','Saturday']),1,0)
date.drop(columns=['product_id','city_id','orders'])
date.head()

,date,product_id,city_id,orders,date_year,date_month,month_name,days,no_days,date_is_weekend
0,2019-12-10,5628,25,3,2019,12,December,Tuesday,10,0
1,2018-08-15,3646,14,157,2018,8,August,Wednesday,15,0
2,2018-10-23,1859,25,1,2018,10,October,Tuesday,23,0
3,2019-08-17,7292,25,1,2019,8,August,Saturday,17,1
4,2019-01-06,4344,25,3,2019,1,January,Sunday,6,1

 Extract week of the year

In [37]:
date['date_week'] =date['date'].dt.day_of_week
date.drop(columns=['product_id','city_id','orders']).head()
date.head(5)

,date,product_id,city_id,orders,date_year,date_month,month_name,days,no_days,date_is_weekend,date_week
0,2019-12-10,5628,25,3,2019,12,December,Tuesday,10,0,1
1,2018-08-15,3646,14,157,2018,8,August,Wednesday,15,0,2
2,2018-10-23,1859,25,1,2018,10,October,Tuesday,23,0,1
3,2019-08-17,7292,25,1,2019,8,August,Saturday,17,1,5
4,2019-01-06,4344,25,3,2019,1,January,Sunday,6,1,6

In [38]:
# extract quarter
date['quater'] =date['date'].dt.quarter
date =date.drop(columns=['product_id','city_id','orders'])
date.head()

,date,date_year,date_month,month_name,days,no_days,date_is_weekend,date_week,quater
0,2019-12-10,2019,12,December,Tuesday,10,0,1,4
1,2018-08-15,2018,8,August,Wednesday,15,0,2,3
2,2018-10-23,2018,10,October,Tuesday,23,0,1,4
3,2019-08-17,2019,8,August,Saturday,17,1,5,3
4,2019-01-06,2019,1,January,Sunday,6,1,6,1

In [39]:
# Extract semseter
date['semester'] = np.where(date['quater'].isin([1,2]),1,2)
date.head()

,date,date_year,date_month,month_name,days,no_days,date_is_weekend,date_week,quater,semester
0,2019-12-10,2019,12,December,Tuesday,10,0,1,4,2
1,2018-08-15,2018,8,August,Wednesday,15,0,2,3,2
2,2018-10-23,2018,10,October,Tuesday,23,0,1,4,2
3,2019-08-17,2019,8,August,Saturday,17,1,5,3,2
4,2019-01-06,2019,1,January,Sunday,6,1,6,1,1

In [41]:
# Extract time elapsed between dates
import datetime
today =datetime.datetime.today()

In [42]:
today

datetime.datetime(2025, 1, 2, 8, 11, 35, 596653)

In [43]:
today -date['date']

0     1850 days 08:11:35.596653
1     2332 days 08:11:35.596653
2     2263 days 08:11:35.596653
3     1965 days 08:11:35.596653
4     2188 days 08:11:35.596653
                 ...
995   2278 days 08:11:35.596653
996   2219 days 08:11:35.596653
997   2067 days 08:11:35.596653
998   2132 days 08:11:35.596653
999   1906 days 08:11:35.596653
Name: date, Length: 1000, dtype: timedelta64[ns]

In [45]:
(today -date['date']).dt.days

0      1850
1      2332
2      2263
3      1965
4      2188
       ...
995    2278
996    2219
997    2067
998    2132
999    1906
Name: date, Length: 1000, dtype: int64

In [49]:
# months passed
np.round((today-date['date'] )/ np.timedelta64(1,'m'),0)

0      2664492.0
1      3358572.0
2      3259212.0
3      2830092.0
4      3151212.0
         ...
995    3280812.0
996    3195852.0
997    2976972.0
998    3070572.0
999    2745132.0
Name: date, Length: 1000, dtype: float64

# time dataset

In [56]:
time =pd.read_csv('dataset\messages.csv')

In [57]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [58]:
time['date'] =pd.to_datetime(time['date'])

In [59]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [60]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] =time['date'].dt.second

In [68]:
time.head()

       date  hour  min  sec
0  00:50:00     0   50    0
1  23:40:00    23   40    0
2  00:21:00     0   21    0
3  00:31:00     0   31    0
4  23:11:00    23   11    0